function thirdBit(params) {
    let bit = +params[0];
    
    
    console.log((bit>>2)&1);
}

// 0000000000001111 (числото 15) 
// Използваме >> което превръща числото в 0000000000000011. Тук търсения трети бит се превръща в първи.
// 0000000000000011 - завъртяното число.
// 0000000000000001 това е единица. &1. логическо И 1.
// 0000000000000001 - получаваме единица след сравнение на шифтнатото число и единицата.

// 00000100     
// 00011011
// 00000000    &&  // В и 0 и 1 е лъжа демек 0
// 00011111    ||  // В или 0 и 1 е истина, защтото едното е истина. Демек 1

thirdBit([`15`]);
thirdBit(['1024']);


